Autodesk.Revit.DB.IFC.IFCImportOptions.SetExtraOptions(System.Collections.Generic.IDictionary{System.String,System.String})
Set the list of extra options to be passed into the importer.  Each entry in the map is a pair of option name and value.
Note that any value here will overwrite the other values in the IFCImportOptions, if it has the same name.
options:
The list of options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1

Autodesk.Revit.DB.IFC.IFCImportOptions.RevitLinkFileName
The full path of the intermediate Revit file created during a previous link action.
This is used during "Reload From" to determine the path to the previous generated Revit file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015